import type { LessonsProps } from "./types/types.js";

export const lessonsTime = [
    { start: "8:10", end: "9:45", },
    { start: "9:55", end: "11:30" },
    { start: "11:40", end: "13:15" },
    { start: "13:35", end: "15:10" },
    { start: "15:20", end: "16:55" },
    { start: "17:05", end: "18:40" }
];

// Временно
export const allLessonsDay: LessonsProps[] = [
    {
        lessons: [
            [{
                title: "Физкультура",
                start: "13:35",
                end: "15:10"
            },
            {
                title: "Информатика - лб",
                start: "15:20",
                end: "16:55"
            },
            {
                title: "Математика - пр",
                start: "17:05",
                end: "18:40"
            }],
            [{
                title: "ИНО",
                start: "11:40",
                end: "13:35"
            }]
        ],
    },
]

// Временно, позже переделаю на автом. распознование списков групп
export const allStudentsList: { id: number, name: string }[] = [
    { id: 1, name: "Башкатов Иван Д." },
    { id: 2, name: "Бородин Никита С." },
    { id: 3, name: "Гришин Максим А." },
    { id: 4, name: "Зимичев Егор А." },
    { id: 5, name: "Золотенкова Надежда В." },
    { id: 6, name: "Качкаев Никита А." },
    { id: 7, name: "Киргизов Андрей Г." },
    { id: 8, name: "Кривоногов Павел В." },
    { id: 9, name: "Курманова Юлия С." },
    { id: 10, name: "Локтев Дмитрий А." },
    { id: 11, name: "Мартынов Александр П." },
    { id: 12, name: "Митрофанов Иван А." },
    { id: 13, name: "Овсянникова Анастасия С." },
    { id: 14, name: "Пащенко Павел П." },
    { id: 15, name: "Петров Леонид Ю." },
    { id: 16, name: "Рябцев Даниил К." },
    { id: 17, name: "Сергеев Алексей В." },
    { id: 18, name: "Ульев Андрей В." },
    { id: 19, name: "Федосеев Семен А." },
    { id: 20, name: "Хайруллин Рифат И." },
    { id: 21, name: "Хитрова Ксения Е." },
    { id: 22, name: "Храмов Кирилл Ю." },
    { id: 23, name: "Чебан Владимир А." },
    { id: 24, name: "Чурашов Алмаз М." },
    { id: 25, name: "Шарадышев Кирилл Ю." },
    { id: 26, name: "Швырин Федор В." },
]